/* # ***** BEGIN LICENSE BLOCK ***** */
/* # Version: MPL 1.1/GPL 2.0/LGPL 2.1 */
/* # */
/* # The contents of this file are subject to the Mozilla Public License Version */
/* # 1.1 (the \"License\"); you may not use this file except in compliance with */
/* # the License. You may obtain a copy of the License at */
/* # http://www.mozilla.org/MPL/ */
/* # */
/* # Software distributed under the License is distributed on an \"AS IS\" basis, */
/* # WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License */
/* # for the specific language governing rights and limitations under the */
/* # License. */
/* # */
/* # The Original Code is mozilla.org code. */
/* # */
/* # The Initial Developer of the Original Code is */
/* # Netscape Communications Corporation. */
/* # Portions created by the Initial Developer are Copyright (C) 1998 */
/* # the Initial Developer. All Rights Reserved. */
/* # */
/* # Contributor(s): */
/* #   Blake Ross <blakeross@telocity.com> (Original Author) */
/* #   Morten Nilsen <morten@nilsen.com> */
/* #   Christian Biesinger <cbiesinger@web.de> */
/* # */
/* # Alternatively, the contents of this file may be used under the terms of */
/* # either of the GNU General Public License Version 2 or later (the \"GPL\"), */
/* # or the GNU Lesser General Public License Version 2.1 or later (the \"LGPL\"), */
/* # in which case the provisions of the GPL or the LGPL are applicable instead */
/* # of those above. If you wish to allow use of your version of this file only */
/* # under the terms of either the GPL or the LGPL, and not to allow others to */
/* # use your version of this file under the terms of the MPL, indicate your */
/* # decision by deleting the provisions above and replace them with the notice */
/* # and other provisions required by the GPL or the LGPL. If you do not delete */
/* # the provisions above, a recipient may use your version of this file under */
/* # the terms of any one of the MPL, the GPL or the LGPL. */
/* # */
/* # ***** END LICENSE BLOCK ***** */

/* #LOCALIZATION NOTE (ImageTitleWithDimensionsAndFile): first %S is filename, second %S is type, third %S is width and fourth %S is height */
/* #LOCALIZATION NOTE (ImageTitleWithoutDimensions): first %S is filename, second %S is type */
/* #LOCALIZATION NOTE (ImageTitleWithDimensions): first %S is type, second %S is width and third %S is height */
/* #LOCALIZATION NOTE (ImageTitleWithNeitherDimensionsNorFile): first %S is type */
/* #LOCALIZATION NOTE (MediaTitleWithFile): first %S is filename, second %S is type */
/* #LOCALIZATION NOTE (MediaTitleWithNoInfo): first %S is type */
"ImageTitleWithDimensionsAndFile" = "%S (%S Image, %Sx%S pixels)";
"ImageTitleWithoutDimensions" = "%S (%S Image)";
"ImageTitleWithDimensions" = "(%S Image, %Sx%S pixels)";
"ImageTitleWithNeitherDimensionsNorFile" = "(%S Image)";
"MediaTitleWithFile" = "%S (%S Object)";
"MediaTitleWithNoInfo" = "(%S Object)";

"InvalidImage" = "The image \u201c%S\u201d cannot be displayed, because it contains errors.";
"ScaledImage" = "Scaled (%S%%)";

"TitleWithStatus" = "%S - %S";
